Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: That is, the temporaries used in calculating the new numerator and denominator are (at least in the abstract) of Int type.
ja: つまり、新しい分子と分母を計算する際に使われるテンポラリーは、Int型である（少なくとも抽象的な）。

source: After a new numerator and denominator are determined, any sign is forced to be represented only by the numerator.
ja: 新しい分子と分母が決定されたあと、何か符号は分子だけによって表現されることを強いられる。

source: Then if the denominator exceeds the storage size of the unsigned integer used, the fraction is reduced via gcd.
ja: そして、分母が使われる符号のない整数の記憶装置の大きさを超えるならば、分数はgcdを通して約分される。

source: If the resulting denominator is still larger than the storage size, then and only then may the precision be reduced to fit into a Rat or Num.
ja: 結果として生じる分母が記憶装置の大きさよりさらに大きいならば、それから、そして、それからだけ、精度はRatまたはNumに適合するために減らされるかもしれない。

source: Rat addition and subtraction should attempt to preserve the denominator of the more precise argument if that denominator is an integral multiple of the less precise denominator.
ja: その分母がより正確でない分母の整数倍であるならば、Rat加算と減算はより正確な引数の分母を保存しようとしなければならない。

source: That is, in practical terms, adding a column of dollars and cents should generally end up with a result that has a denominator of 100, even if values like 42 and 3.5 were added in. With other operators, this guarantee cannot be made;
ja: つまり、実際的な項で、たとえ42と3.5のような値が中に加えられたとしても、ドルとセントの列を加えることが100の分母を持つ結果で通常、終わらなければならなくて。他の演算子と、この保証は作られることができない;

source: in such cases, the user should probably be explicitly rounding to a particular denominator anyway.
ja: そのような場合、ユーザーはいずれにしろ特定の分母まで多分はっきりと丸くなければならないだろう。

source: For applications that really need arbitrary precision denominators as well as numerators at the cost of performance, FatRat may be used, which is defined as Rational[Int,Int], that is, as arbitrary precision in both parts.
ja: パフォーマンスを犠牲にして随意精度分母ならびに分子を本当に必要とするアプリケーションについては、FatRatが使われるかもしれない。そして、それはRational[Int,Int]として定義される（つまり、両方のパーツの随意精度として）。

source: There is no literal form for a FatRat, so it must be constructed using FatRat.new($nu,$de).
ja: 文字通りの形がFatRatのためにないので、それはFatRat.new($nu,$de)を使って造られなければならない。

source: In general, only math operators with at least one FatRat argument will return another FatRat, to prevent accidental promotion of reasonably fast Rat values into arbitrarily slow FatRat values.
ja: 一般に、少なくとも1つのFatRat引数による数学演算子だけはもう一つのFatRatを返る。そして、任意に遅いFatRat値にかなり速いRat値の偶発的なプロモーションを防ぐ。

source: Although most rational implementations normalize or &quot;reduce&quot; fractions to their smallest representation immediately through a gcd algorithm, Perl allows a rational datatype to do so lazily at need, such as whenever the denominator would run out of precision, but avoid the overhead otherwise.
ja: 大部分の合理的な実装がgcdアルゴリズムによってすぐ分数を彼らの最も小さな代表に正常化するか、「下げる」が、分母が精度を使い果たすが、さもなければオーバーヘッドを避けるときはいつでも、Perlは合理的なデータ型が必要で、例えばゆったりとそうするのを許す。

source: Hence, if you are adding a bunch of Rats that represent, say, dollars and cents, the denominator may stay 100 the entire way through.
ja: それゆえに、あなたが、まあ、ドルとセントを表現するたくさんのRatsを加えているならば、分母は終わりまで全方法で100のままであるかもしれない。

source: The .nu and .de methods will return these unreduced values.
ja: .nuと.deメソッドは、これらのunreducedされた値を返る。

source: You can use $rat.=norm to normalize the fraction.
ja: あなたは、分数を正常化するために、$rat.=normを使うことができる。

source: (This also forces the sign on the denominator to be positive.) The .perl method will produce a decimal number if the denominator is a power of 10, or normalizable to a power of 10 (that is, having factors of only 2 and 5 (and -1)).
ja: 分母が10の累乗または10（つまり、わずか2と5の（そして、-1）指数を持つ）の力へのnormalizableであるならば、.perlメソッドは十進数を生じる（これも分母の符号にプラスのことを強いる。）。

source: Otherwise it will normalize and return a rational literal of the form &lt;-47/3&gt;.
ja: さもなければ、それは正常化して、形&lt;-47/3&gt;の合理的なリテラルを返る。

source: Stringifying a rational via .gist or .Str returns an exact decimal number if possible, and otherwise rounds off the repeated decimal based on the size of the denominator.
ja: .gistまたは.Strを経た有理数ができれば正確な十進数に返るStringifying、やその他は、分母のサイズに基づく繰り返された小数を四捨五入する。

source: For full details see the documentation of Rat.gist in S32.
ja: 完全細目のために、S32でRat.gistのドキュメンテーションを見なさい。

source: Num.Str and Num.gist both produce valid Num literals, so they must include the e for the exponential.
ja: Num.StrとNum.gistは有効なNumリテラルを両方とも生じるので、それらは指数関数のためにeを含まなければならない。

source: Infinity and NaN
ja: 無限とNaN

source: Perl 6 by default makes standard IEEE floating point concepts visible, such as Inf (infinity) and NaN (not a number).
ja: Perl 6は、Inf（無限）とNaN（特別なビットパターン表現法）のような、標準的なIEEE浮動小数点概念をデフォルトで見えるようにする。

source: Within a lexical scope, pragmas may specify the nature of temporary values, and how floating point is to behave under various circumstances.
ja: レキシカルスコープの中で、プラグマは、テンポラリー値の性質と浮動小数点がいろいろな状況の下でふるまうことになっている方法を指定するかもしれない。

source: All IEEE modes must be lexically available via pragma except in cases where that would entail heroic efforts to bypass a braindead platform.
ja: すべてのIEEEモードは、それがbraindeadプラットホームを迂回する英雄的な努力を伴うケースを除いて、プラグマを通して辞書的に利用できなければならない。

source: The default floating-point modes do not throw exceptions but rather propagate Inf and NaN.
ja: デフォルト浮動小数点モードは例外を投げなくて、むしろ最大下界とナンを繁殖させる。

source: The boxed object types may carry more detailed information on where overflow or underflow occurred.
ja: 箱入りオブジェクトタイプは、オーバーフローかアンダーフローがどこで起こったかについて、より多くの詳細をもたらすかもしれない。

source: Numerics in Perl are not designed to give the identical answer everywhere.
ja: Perlの数字は、至る所で同一の答えをするようになっていない。

source: They are designed to give the typical programmer the tools to achieve a good enough answer most of the time.
ja: それらは、典型的プログラマーにほとんど良い十分な答えを成し遂げるためのツールを与えるようになっている。

source: (Really good programmers may occasionally do even better.) Mostly this just involves using enough bits that the stupidities of the algorithm don't matter much.
ja: 大部分はこれは、ちょうどアルゴリズムの愚かさがあまり重要でない十分なビットを使うことが必要である（本当に良いプログラマーは、よりよく時折しさえするかもしれない。）。

source: Strings, the Str Type
ja: 文字列、Str型

source: A Str is a Unicode string object. There is no corresponding native str type.
ja: Strはユニコード文字列オブジェクトである。対応するネイティブstr型がない。

source: However, since a Str object may fill multiple roles, we say that a Str keeps track of its minimum and maximum Unicode abstraction levels, and plays along nicely with the current lexical scope's idea of the ideal character, whether that is bytes, codepoints, graphemes, or characters in some language.
ja: しかし、Strオブジェクトが複数のロールを満たすかもしれない時から、Strがその最小限で最大ユニコード抽象概念レベルの経過を追って、うまく、それがいくらかの言語のバイト、コードポイント、書記素または文字であるかどうかにかかわらず理想的な文字についての現在のレキシカルスコープの考えと調子を合わせると、我々は言う。

source: The StrPos Type
ja: StrPos型

source: For all builtin operations, all Str positions are reported as position objects, not integers.
ja: すべての組み込まれた演算のために、すべてのStr位置は、位置オブジェクト（整数でない）として報告される。

source: These StrPos objects point into a particular string at a particular location independent of abstraction level, either by tracking the string and position directly, or by generating an abstraction-level independent representation of the offset from the beginning of the string that will give the same results if applied to the same string in any context.
ja: 抽象概念レベル（直接文字列と位置を行くことによるどちらでも）から独立している特定の場所で、または、何か前後関係で同じ文字列に適用されるならば、同じ結果を与える文字列の始まりからオフセットの抽象概念レベルの独立した表現を生み出すことによって、これらのStrPosオブジェクトは、特定の文字列にポイントする。

source: This is assuming the string isn't modified in the meanwhile;
ja: これは、文字列が合間に修正されないと仮定している;

source: a StrPos is not a &quot;marker&quot; and is not required to follow changes to a mutable string.
ja: StrPosは目印でなくて、変わりやすい文字列の変更に続くことを要求されない。

source: For instance, if you ask for the positions of matches done by a substitution, the answers are reported in terms of the original string (which may now be inaccessible!), not as positions within the modified string.
ja: たとえば、あなたが代用によってされるマッチの位置を求めるならば、改訂文字列の範囲内の位置ではなく、答えは元の文字列（そしてそれは、現在近づきがたい場合がある！）に関して報告される。

source: The StrLen Type
ja: StrLen型

source: The subtraction of two StrPos objects gives a StrLen object, which is also not an integer, because the string between two positions also has multiple integer interpretations depending on the units.
ja: 2つの位置の間の文字列も単位に従い複数の整数字句解釈をするので、2つのStrPosオブジェクトの引き算はStrLenオブジェクト（それは整数でもない）を伝える。

source: A given StrLen may know that it represents 7 codepoints, 3 graphemes, and 1 letter in Malayalam, but it might only know this lazily because it actually just hangs onto the two StrPos endpoints within the string that in turn may or may not just lazily point into the string.
ja: 所定のStrLenはそれがマラーヤラム語で7つのコードポイント、3つの書記素と1通の手紙を表現するということを知っているかもしれない、しかし、文字列につぎにはちょうどゆったりと指すかもしれないか、指さないかもしれない文字列の範囲内で実はちょうど2つのStrPosエンドポイントにしがみつくので、それはゆったりとこれを知っているだけかもしれない。

source: (The lazy implementation of StrLen is much like a Range object in that respect.)
ja: （StrLenの怠惰な実装はその点で非常にRangeオブジェクトのようである。）

source: Units of Position Arguments
ja: 位置引数の単位

source: If you use integers as arguments where position objects are expected, it will be assumed that you mean the units of the current lexically scoped Unicode abstraction level.
ja: あなたが位置オブジェクトが予想される引数として整数を使うならば、あなたが現在の辞書的に捜し出されたユニコード抽象概念レベルの単位を意味すると仮定される。

source: (Which defaults to graphemes.) Otherwise you'll need to coerce to the proper units:
ja: さもなければあなたは、適当な単位に以下を強制する必要がある（そしてそれは書記素へのデフォルト。）：

source: Of course, such a dimensional number will fail if used on a string that doesn't provide the appropriate abstraction level.
ja: もちろん、適正抽象概念レベルを提供しない文字列で使われるならば、そのような次元の数は失敗する。

source: Numeric Coercion of StrPos or StrLen
ja: StrPosまたはStrLenの数の強制

source: If a StrPos or StrLen is forced into a numeric context, it will assume the units of the current Unicode abstraction level.
ja: StrPosまたはStrLenが数値コンテキストに強制されるならば、それは現在のユニコード抽象概念レベルの単位を引き受ける。

source: It is erroneous to pass such a non-dimensional number to a routine that would interpret it with the wrong units.
ja: 間違った単位でそれを解釈するルーチンにそのような無次元数を通過することは、誤りである。

source: Implementation note:
ja: 処理系への注：

source: since Perl 6 mandates that the default Unicode processing level must view graphemes as the fundamental unit rather than codepoints, this has some implications regarding efficient implementation.
ja: Perl 6がデフォルトユニコード処理段階が書記素をコードポイントよりもむしろ基本単位として見なければならないと命じる時から、これには効率的実装に関して若干の含みがある。

source: It is suggested that all graphemes be translated on input to unique grapheme numbers and represented as integers within some kind of uniform array for fast substr access.
ja: すべての書記素がユニークな書記素番号への入力で変形されて、速いsubstrアクセスのための何らかの均一な配列の中の整数として表現されることを示唆される。

source: For those graphemes that have a precomposed form, use of that codepoint is suggested.
ja: precomposedされた形があるそれらの書記素のために、そのコードポイントの使用は、提案される。

source: (Note that this means Latin-1 can still be represented internally with 8-bit integers.)
ja: （この手段ラテン語-1がまだ８ビット整数で内部的に表現されることができることに注意すべきである。）

source: For graphemes that have no precomposed form, a temporary private id should be assigned that uniquely identifies the grapheme.
ja: precomposedされた形がない書記素のために、書記素をユニークに識別する一時的な個人的なIDは、割り当てられなければならない。

source: If such ids are assigned consistently throughout the process, comparison of two graphemes is no more difficult than the comparison of two integers, and comparison of base characters no more difficult than a direct lookup into the id-to-NFD table.
ja: そのようなIDがプロセスを通して一貫して割り当てられるならば、2つの書記素の比較は2整数の比較とNFDへのIDテーブルへの直接ルックアップと同様、難しくないベース文字の比較と同様、難しくない。

source: Obviously, any temporary grapheme ids must be translated back to some universal form (such as NFD) on output, and normal precomposed graphemes may turn into either NFC or NFD forms depending on the desired output.
ja: 明らかに、何かテンポラリー書記素IDは出力の上で若干の一般的な形（例えばNFD）へ変形されなければならない、そして、通常のprecomposedされた書記素はNFCか所望出力次第であるNFDの形態に変わるかもしれない。

source: Maintaining a particular grapheme/id mapping over the life of the process may have some GC implications for long-running processes, but most processes will likely see a limited number of non-precomposed graphemes.
ja: プロセスの人生の間特定の書記素/IDマッピングを維持することは長時間にわたるプロセスへの若干のGC含みがあるかもしれない、しかし、大部分のプロセスは限られた数の非precomposedされた書記素にたぶん遭遇する。

source: If the program has a scope that wants a codepoint view rather than a grapheme view, the string visible to that lexical scope must also be translated to universal form, just as with output translation.
ja: プログラムが書記素見方よりもむしろコードポイント見方が欲しいスコープを持つならば、ちょうど出力翻訳と同様に、そのレキシカルスコープに見える文字列は一般的な形にも変形されなければならない。

source: Alternately, the temporary grapheme ids may be hidden behind an abstraction layer.
ja: あるいは、一時的な書記素IDは、抽象概念層の後に隠されるかもしれない。

source: In any case, codepoint scope should never see any temporary grapheme ids.
ja: いずれにせよ、コードポイントスコープは、何かテンポラリー書記素IDに決して遭遇してはならない。

source: (The lexical codepoint declaration should probably specify which normalization form it prefers to view strings under.
ja: （語彙的なコードポイント宣言は、それがどの正常化用紙の下で文字列を見るのを好むかについて、多分指定しなければならないだろう。

source: Such a declaration could be applied to input translation as well.)
ja: そのような宣言は、同様に翻訳を入力するために適用されることができた。）

source: The Buf Type
ja: Buf型

source: A Buf is a stringish view of an array of integers, and has no Unicode or character properties without explicit conversion to some kind of Str.
ja: Bufは多数の整数のstringish見方で、何らかのStrへの明示的転換なしで、ユニコードまたは文字プロパティを持たない。

source: (The buf8, buf16, buf32, and buf64 types are the native counterparts;
ja: （buf8、buf16、buf32とbuf64型は、ネイティブ対応する物である;

source: native buf types are required to occupy contiguous memory for the entire buffer.) Typically a Buf is an array of bytes serving as a buffer.
ja: ネイティブbuf型は全てのバッファのために連続メモリを占有することを要求される。）、一般的に、Bufはバッファとして用いられている多数のバイトである。

source: Bitwise operations on a Buf treat the entire buffer as a single large integer.
ja: Bufの上のビットごとの演算は、全てのバッファを一つの大きな整数とみなす。

source: Bitwise operations on a Str generally fail unless the Str in question can provide an abstract Buf interface somehow.
ja: 問題のStrがどうにか、抽象的なBufインターフェースを提供することができない限り、Strの上のビットごとの演算は一般に失敗する。

source: Coercion to Buf should generally invalidate the Str interface.
ja: Bufへの強制は、通常、Strインターフェースを無効にしなければならない。

source: As a generic role Buf may be instantiated as any of buf8, buf16, or buf32 (or as any type that provides the appropriate Buf interface), but when used to create a buffer Buf is punned to a class implementing buf8 (actually Buf[uint8]).
ja: 一般的なロールBufがbuf8、buf16またはbuf32（または適正にBufインターフェースを提供する何か型として）のどれとしてでも具体例をあげて示されるかもしれなくて、わずかにいつBufがそうであるバッファをつくったものであるbuf8（実際にBuf[uint8]）を実装しているクラスにもじった。

source: Unlike Str types, Buf types prefer to deal with integer string positions, and map these directly to the underlying compact array as indices.
ja: Str型とは異なり、Buf型は整数文字列位置に対処するのを好んで、インデックスとして直接これらを根底にあるコンパクトな配列にマップする。

source: That is, these are not necessarily byte positions--an integer position just counts over the number of underlying positions, where one position means one cell of the underlying integer type.
ja: つまり、これらが必ずしもバイト位置であるというわけではない－整数位置はちょうど下にある位置の数以上数える、そこで、1つの位置は根底にある整数型の1つのセルを意味する。

source: Builtin string operations on Buf types return integers and expect integers when dealing with positions.
ja: 位置に対処するとき、Buf型に関する組み込まれた文字列演算は整数を返って、整数を予想する。

source: As a limiting case, buf8 is just an old-school byte string, and the positions are byte positions.
ja: 制限的なケースとして、buf8はちょうど保守的なバイト文字列である、そして、位置はバイト位置である。

source: Note, though, that if you remap a section of buf32 memory to be buf8, you'll have to multiply all your positions by 4.
ja: しかし、あなたがbuf8であるbuf32メモリのセクションを再配置するならば、あなたがあなたのすべての位置に4を掛け算しなければならない点に注意しなさい。

source: Native buf Types
ja: ネイティブbuf型

source: These native types are defined based on the Buf role, parameterized by the native integer type it is composed of:
ja: これらのネイティブ型は、Bufロールに基づいて、それが成るネイティブ整数型によってパラメータ化されて定義される：

source: There are no signed buf types provided as built-ins, but you may say
ja: 内蔵として提供される署名されたbuf型がない、しかし、あなたは言うかもしれない

source: to get buffers of signed integers.
ja: 符号付き整数のバッファを得ること。

source: It is also possible to define a Buf based on non-integers or on non-native types:
ja: 非整数次の上で、または、ネイティブでない型上で基づくBufを定義することも、あり得る：

source: However, no guarantee of memory contiguity can be made for non-native types.
ja: しかし、メモリ接近の保証は、ネイティブでない型のために作られることができない。

source: The Whatever Object
ja: Whateverオブジェクト

source: The * character as a standalone term captures the notion of &quot;Whatever&quot;, the meaning of which can be decided lazily by whatever it is an argument to. Alternately, for those unary and binary operators that don't care to handle * themselves, it is automatically primed at compile time into a closure that takes one or two arguments.
ja: 独立型項としての*文字は、&quot;Whatever&quot;の概念をとらえる。そして、それの意味は、それが引数であるものは何によってでも、ゆったりと決定されることができる。あるいは、単一体のそれらと*自体を取り扱いたいと思わない2項演算子については、それは、1、2引数をするクロージャに、コンパイル時で自動的に準備をされる。

source: (See below.)
ja: （下記参照。）

source: Generally, when an operator handles * itself, it can often be thought of as a &quot;glob&quot; that gives you everything it can in that argument position.
ja: 通常、演算子が*自体を取り扱うとき、それはあなたにそれがその引数位置でそうすることができるすべてを与える&quot;glob&quot;としばしばみなされることができる。

source: For instance, here are some operators that choose to handle * and give it special meaning:
ja: たとえば、*を取り扱って、それに以下を意味しているスペシャルを与えるほうを選ぶ一部の演算子は、ここにいる：

source: Whatever is an undefined prototype object derived from Any.
ja: Whateverは、Anyに由来する未定義プロトタイプオブジェクトである。

source: As a type it is abstract, and may not be instantiated as a defined object.
ja: 型として、それは抽象的で、定義済みオブジェクトとして具体例をあげて示されないかもしれない。

source: When used for a particular MMD dispatch, and nothing in the MMD system claims it, it dispatches to as an Any with an undefined value, and (we hope) blows up constructively.
ja: 特定のMMDディスパッチとMMDシステム主張の何ものためにそれを使わなかったとき、それは指名する｛何でも｝、未定義値と上へ（我々は期待する）打撃建設的にで。

source: Since the Whatever object is effectively immutable, the optimizer is free to recognize * and optimize in the context of what operator it is being passed to.
ja: Whateverオブジェクトが事実上不変であるので、オプティマイザーはそれがどんな演算子であるかという前後関係の*と最適化が渡ったことを認知するのは無料である。

source: An operator can declare that it wants to handle * either by declaring one or more of its arguments for at least one of its candidates with an argument of type Whatever, or by marking the proto sub with the trait, is like-Whatever-and-stuff.
ja: それが1を宣言することによる、または、より型Whateverの引数をもつ、または、トレイト（is like-Whatever-and-stuff）でプロトサブに跡を残すことによる候補の少なくとも1人のための引数の*を取り扱いたいと、演算子は断言することができる。

source: [Conjecture: actually, this is negotiable--we might shorten it to is like(Whatever) or some such. :-)]
ja: ［推測する：実は、これは交渉可能である－我々は、is like(Whatever)または少しそれにそれを短くするかもしれない。:-)]

source: Autopriming of Unary and Binary Operators with Whatever
ja: 同類をもつ単一体とバイナリの演算子のAutopriming

source: Perl 6 has several ways of performing partial function application.
ja: Perl 6には、部分関数アプリケーションを実行することのいくつかの方法がある。

source: Since this is an unwieldy term, we've settled on calling it priming.
ja: これが扱いにくい項であるので、我々はそれをプライミングと呼ぶことにした。

source: (Many folks call this &quot;currying&quot;, but that's not really a correct technical usage of the term.) Most generally, priming is performed on a Callable object by calling its .assuming method, described elsewhere.
ja: 最も通常、準備をすることはその.assumingメソッドを呼ぶことによってCallableオブジェクトで実行される（多くの人々はこの「カレーで調理する」ことを呼ぶ、しかし、それは本当に項の正しい技術的な使用法でない。）。そして、どこかほかで記述される。

source: This section is about a convenient syntactic sugar for that.
ja: このセクションは、それのために便利な構文法のシュガーについてである。

source: For any unary or binary operator (specifically, any prefix, postfix, and infix operator), if the operator has not specifically requested (via signature matching) to handle * itself, the compiler is required to translate directly to an appropriately primed closure at compile time.
ja: 単一体の何でもまたは2項演算子（とりわけ、何か接頭辞、接尾辞とインフィックスオペレータ）については、演算子が特に*自体を取り扱うことを要求しなかった（合っているシグネチャを通して）ならば、コンパイラはコンパイルで適切に準備をされたクロージャに直接時間を変形することを要求される。

source: We call this autopriming.
ja: 我々は、このautoprimingを呼ぶ。

source: Most of the built-in numeric operators fall into this category.
ja: 大部分のビルトイン算術演算子は、このカテゴリーに分類される。

source: So:
ja: そう：

source: are autoprimed into closures of one or two arguments:
ja: 1、2引数のクロージャにautoprimedされる：

source: This rewrite happens after variables are looked up in their lexical scope, and after declarator install any variables into the lexical scope, with the result that
ja: 変数が彼らのレキシカルスコープで調べられて、宣言の後レキシカルスコープに何か変数をインストールしたあと、このリライトは起こる、結果でその

source: is effectively primed into:
ja: 以下に効果的に準備をされる：

source: rather than:
ja: むしろ以下より：

source: In other words, * priming does not create a useful lexical scope.
ja: 言い換えると、*準備をすることは、役に立つレキシカルスコープをつくらない。

source: (Though it does have a dynamic scope when it runs.) This prevents the semantics from changing drastically if the operator in question suddenly decides to handle Whatever itself.
ja: 問題の演算子がWhatever自体を取り扱うことに突然決めるならば、これは意味論がまったく変わるのを防ぐ（それが走るときそれが動的スコープを持つけれども。）。

source: As a postfix operator, a method call is one of those operators that is automatically primed.
ja: 後置演算子として、メソッド呼び出しは、自動的に準備をされるそれらの演算子の1人である。

source: Something like:
ja: 以下のような何か：

source: is rewritten as:
ja: 書き直す：

source: In addition to priming a method call without an invocant, such primed methods are handy anywhere a smartmatcher is expected:
ja: インボカントなしでメソッド呼び出しの準備をすることに加えて、そのような準備をされたメソッドは、すぐ手近に、スマートマッチャーが予想される場所である：

source: Metaoperators are treated as normal operators;
ja: メタ演算子は、通常の演算子とみなされる;

source: the autopriming does not automatically distribute to the inner operator.
ja: autoprimingすることは、内部の演算子に自動的に割り当てない。

source: does not make a list of closures, but is equivalent to
ja: doesは、クロージャのリストをしない、等しくない

source: Postcircumfixes (with or without the dot) are also autoprimed, so we have
ja: Postcircumfixes（点の有無にかかわらず）もautoprimedされるので、我々はそうした

source: The WhateverCode Types
ja: WhateverCode型

source: These returned closures are of type WhateverCode:($) or WhateverCode:($,$) rather than type Whatever, so constructs that do want to handle * or its derivative closures can distinguish them by type:
ja: これらの返られたクロージャは型Whateverよりもむしろ型WhateverCode:($)またはWhateverCode:($,$)であるので、*またはその派生的なクロージャを取り扱いたい構成概念はそれらを型によって識別することができる：

source: For any prefix, infix, postfix, or postcircumfix operator that would be primed by a Whatever, a WhateverCode also autoprimes it, such that any noun phrase based on * as a head noun autoprimes transitively outward as far as it makes sense, including outward through metaoperators.
ja: 何か接頭辞、挿入辞、接尾辞またはWhateverによって準備をされるpostcircumfix演算子のために、WhateverCodeもautoprimesそれ（それがメタ演算子を通して外向きを含む意味をなす限り何か名詞句が他動的に外へヘッド名詞autoprimesとして*に基づいたような）。

source: Hence:
ja: それゆえに：

source: Note in particular that parentheses will autoprime on a WhateverCode, so
ja: 特に、そう、括弧がWhateverCodeの上でautoprimeにそうする注

source: means
ja: 手段

source: If you want the latter semantics for some reason, use a temporary:
ja: あなたが何かの理由で後の意味論を望むならば、テンポラリーを使いなさい：

source: or just put the autoprime in parens:
ja: あるいは、ちょうどautoprimeを括弧に置く：

source: Operators with idiosyncratic Whatever
ja: 特有のWhateverをもつ演算子

source: The above is only for operators that are not Whatever-aware.
ja: 上記は、Whateverわかっていない演算子に賛成であるだけである。

source: There is no requirement that a Whatever-aware operator return a WhateverCode when Whatever is used as an argument;
ja: Whateverわかっている演算子がWhateverが引数として使われるWhateverCodeを返るという必要が、ない;

source: that's just the typical behavior for functions that have no intrinsic &quot;globbish&quot; meaning for *.
ja: それは、ちょうど*のために固有の&quot;globbish&quot;意味を持たない関数のための典型的ふるまいである。

source: If you want to prime one of these globbish operators, you'll need to write an explicit closure or do an explicit priming on the operator with .assuming().
ja: これらのglobbish演算子の1人の準備をしたいならば、あなたは明示的クロージャを書くか、.assuming()で演算子の上で明示的プライミングをする必要がある。

source: Operators in this class, such as infix:&lt;..&gt; and infix:&lt;xx&gt;, typically do autoprime arguments of type WhateverCode even though they do not autoprime Whatever, so we have:
ja: たとえそれらがautoprime｛全く｝をしないとしても、このクラス（例えばinfix:&lt;..&gt;とinfix:&lt;xx&gt;）の演算子は型WhateverCodeのautoprime引数を概してするので、我々は以下を持つ：
